---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationOfOneSystem
source: html/9ca4a886-0717-4877-43e3-f88933b66e22.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.HydraulicSeparationOfOneSystem Property

Unable to hydraulically separate the loop when both supply and return are assigned to the same system. Try again with both start and end selected.

## Syntax (C#)
```csharp
public static FailureDefinitionId HydraulicSeparationOfOneSystem { get; }
```